
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_project.project: Reading...
google_service_account.cloud_run_scheduler: Refreshing state... [id=projects/rising-sector-360922/serviceAccounts/scheduler@rising-sector-360922.iam.gserviceaccount.com]
google_service_account.cloud_run_sa: Refreshing state... [id=projects/rising-sector-360922/serviceAccounts/gmail-watcher@rising-sector-360922.iam.gserviceaccount.com]
google_storage_bucket.file_bucket["Council Data Sales"]: Refreshing state... [id=council_data_sales_new]
google_storage_bucket.file_bucket["Council Data DVR"]: Refreshing state... [id=council_data_dvr_new]
google_project_iam_member.datastore_user: Refreshing state... [id=rising-sector-360922/roles/datastore.user/serviceAccount:gmail-watcher@rising-sector-360922.iam.gserviceaccount.com]
google_cloud_run_v2_job.gmail_watcher: Refreshing state... [id=projects/rising-sector-360922/locations/us-central1/jobs/gmail-watcher]
google_cloud_run_v2_job_iam_member.cloud_run_invoker_member: Refreshing state... [id=projects/rising-sector-360922/locations/us-central1/jobs/gmail-watcher/roles/run.invoker/serviceAccount:scheduler@rising-sector-360922.iam.gserviceaccount.com]
data.google_project.project: Read complete after 1s [id=projects/rising-sector-360922]
google_cloud_scheduler_job.trigger_job: Refreshing state... [id=projects/rising-sector-360922/locations/us-central1/jobs/schedule-gmail-watcher]
google_storage_bucket_iam_member.storage_member["Council Data DVR"]: Refreshing state... [id=b/council_data_dvr/roles/storage.admin/serviceAccount:gmail-watcher@rising-sector-360922.iam.gserviceaccount.com]
google_storage_bucket_iam_member.storage_member["Council Data Sales"]: Refreshing state... [id=b/council_data_sales/roles/storage.admin/serviceAccount:gmail-watcher@rising-sector-360922.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_job.gmail_watcher must be replaced
-/+ resource "google_cloud_run_v2_job" "gmail_watcher" {
      ~ conditions               = [] -> (known after apply)
      ~ etag                     = "\"CJaI4aYGEKjinLAD/cHJvamVjdHMvcmlzaW5nLXNlY3Rvci0zNjA5MjIvbG9jYXRpb25zL3VzLWNlbnRyYWwxL2pvYnMvZ21haWwtd2F0Y2hlcg\"" -> (known after apply)
      ~ execution_count          = 137 -> (known after apply)
      ~ generation               = "13" -> (known after apply)
      ~ id                       = "projects/rising-sector-360922/locations/us-central1/jobs/gmail-watcher" -> (known after apply)
      - labels                   = {} -> null
      ~ latest_created_execution = [
          - {
              - completion_time = "2023-12-11T08:00:51.542019Z"
              - create_time     = "2023-12-11T08:00:00.903332Z"
              - name            = "gmail-watcher-4jjh8"
            },
        ] -> (known after apply)
      ~ launch_stage             = "GA" -> (known after apply)
      ~ location                 = "us-central1" -> "australia-southeast1" # forces replacement
        name                     = "gmail-watcher"
      ~ observed_generation      = "13" -> (known after apply)
      ~ project                  = "rising-sector-360922" -> (known after apply)
      ~ reconciling              = false -> (known after apply)
      ~ terminal_condition       = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2023-08-04T08:28:14.256192Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "Ready"
            },
        ] -> (known after apply)
      ~ uid                      = "40d32b96-168a-4cde-9edd-c94c154e8c04" -> (known after apply)

      ~ template {
          - labels      = {} -> null
          ~ parallelism = 0 -> (known after apply)
          ~ task_count  = 1 -> (known after apply)

          ~ template {
              ~ execution_environment = "EXECUTION_ENVIRONMENT_GEN2" -> (known after apply)
              ~ timeout               = "600s" -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  ~ image   = "us-central1-docker.pkg.dev/rising-sector-360922/artifact-registry/gmail-watcher:17f6b8515b256f2148f904bb0052a18b922dca2f" -> "us-central1-docker.pkg.dev/rising-sector-360922/docker-images/gmail-watcher:17f6b8515b256f2148f904bb0052a18b922dca2f"

                  ~ env {
                        name  = "labels_to_process"
                      ~ value = "council_data_dvr,council_data_dvr,council_data_sales,council_data_sales" -> "council_data_dvr,council_data_dvr_new,council_data_sales,council_data_sales_new"
                    }

                  - resources {
                      - limits = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                    }

                    # (1 unchanged block hidden)
                }
            }
        }
    }

  # google_cloud_run_v2_job_iam_member.cloud_run_invoker_member must be replaced
-/+ resource "google_cloud_run_v2_job_iam_member" "cloud_run_invoker_member" {
      ~ etag     = "BwYCKS3T3fI=" -> (known after apply)
      ~ id       = "projects/rising-sector-360922/locations/us-central1/jobs/gmail-watcher/roles/run.invoker/serviceAccount:scheduler@rising-sector-360922.iam.gserviceaccount.com" -> (known after apply)
      ~ location = "us-central1" -> "australia-southeast1" # forces replacement
      ~ name     = "projects/rising-sector-360922/locations/us-central1/jobs/gmail-watcher" -> "gmail-watcher"
        # (3 unchanged attributes hidden)
    }

  # google_cloud_scheduler_job.trigger_job must be replaced
-/+ resource "google_cloud_scheduler_job" "trigger_job" {
      ~ id               = "projects/rising-sector-360922/locations/us-central1/jobs/schedule-gmail-watcher" -> (known after apply)
        name             = "schedule-gmail-watcher"
      ~ paused           = false -> (known after apply)
      ~ region           = "us-central1" -> "australia-southeast1" # forces replacement
      ~ state            = "ENABLED" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ http_target {
          - headers     = {} -> null
          ~ uri         = "https://us-central1-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/950322501036/jobs/gmail-watcher:run" -> "https://australia-southeast1-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/950322501036/jobs/gmail-watcher:run"
            # (1 unchanged attribute hidden)

          ~ oauth_token {
              - scope                 = "https://www.googleapis.com/auth/cloud-platform" -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ retry_config {
          ~ max_backoff_duration = "3600s" -> (known after apply)
          ~ max_doublings        = 5 -> (known after apply)
          ~ max_retry_duration   = "0s" -> (known after apply)
          ~ min_backoff_duration = "5s" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # google_storage_bucket.file_bucket["Council Data DVR"] will be updated in-place
  ~ resource "google_storage_bucket" "file_bucket" {
        id                          = "council_data_dvr_new"
        name                        = "council_data_dvr_new"
        # (11 unchanged attributes hidden)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 10
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }

      - timeouts {}
    }

  # google_storage_bucket_iam_member.storage_member["Council Data DVR"] must be replaced
-/+ resource "google_storage_bucket_iam_member" "storage_member" {
      ~ bucket = "b/council_data_dvr" -> "council_data_dvr_new" # forces replacement
      ~ etag   = "CAQ=" -> (known after apply)
      ~ id     = "b/council_data_dvr/roles/storage.admin/serviceAccount:gmail-watcher@rising-sector-360922.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_member.storage_member["Council Data Sales"] must be replaced
-/+ resource "google_storage_bucket_iam_member" "storage_member" {
      ~ bucket = "b/council_data_sales" -> "council_data_sales_new" # forces replacement
      ~ etag   = "CAM=" -> (known after apply)
      ~ id     = "b/council_data_sales/roles/storage.admin/serviceAccount:gmail-watcher@rising-sector-360922.iam.gserviceaccount.com" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Wallace99, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Deploy`*